
" ------------------------------------------------------------------------------
"  General
" ------------------------------------------------------------------------------

" エラー時のビープ音や画面フラッシュ.
set noerrorbells

" ステータス行へのカーソル位置の表示.
set ruler

" 行番号の表示.
set nonumber

" 行がウィンドウ幅より長い場合の折り返し.
set nowrap

" 文字幅が曖昧 (文脈によって文字幅が異なる) 文字の表示幅.
"     single : ASCII 文字 1 文字分の幅で表示.
"     double : ASCII 文字 2 文字分の幅で表示.
set ambiwidth=double

" diff モード時のオプション.
set diffopt=context:77777

" .viminfo ファイルの設定.
set viminfo=

" シンタックスハイライト.
syntax off

" ------------------------------------------------------------------------------
"  Backup
" ------------------------------------------------------------------------------

" 保存時のバックアップファイルの作成.
set nobackup

" ------------------------------------------------------------------------------
"  File
" ------------------------------------------------------------------------------

" 改行コード.
"     dos  : <CR><LF>
"     mac  : <LF>
"     unix : <CR>
set fileformats=unix,dos,mac

" vim 内部, ファイル, ターミナルのエンコーディング.
set encoding=utf-8
set fileencoding=utf-8
set termencoding=utf-8

" ------------------------------------------------------------------------------
"  Search
" ------------------------------------------------------------------------------

" 行頭, 行末を越えたカーソル移動を行うキー.
set whichwrap=b,s,h,l,<,>

" インクリメンタルサーチ.
set incsearch

" 検索ヒット時のハイライト表示.
set nohlsearch

" 検索時の大文字小文字の区別.
set ignorecase

" 検索キーワードに大文字小文字が混在する場合の ignorecase の無効化.
set smartcase

" 検索で末尾に達した場合の先頭からの再検索の実行.
set nowrapscan

" ------------------------------------------------------------------------------
"  Edit
" ------------------------------------------------------------------------------

" UNDO レベル.
set undolevels=10240

" <BACKSPACE> で削除を許可する文字.
"     indent : autoindent により挿入されたインデント.
"     eol    : 改行文字.
"     start  : 挿入区間の開始.
set backspace=indent,eol,start

" 改行時の自動インデント.
set noautoindent

" 自動インデント時のスペース数.
set shiftwidth=4

" TAB の表示幅.
set tabstop=4

" TAB 挿入時のスペースへの展開.
set expandtab

