
tap "homebrew/bundle"
tap "homebrew/core"

brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cabal-install"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "erlang"
brew "findutils"
brew "gauche"
brew "gawk"
brew "gforth"
brew "ghc"
brew "git"
brew "gnu-sed"
brew "go"
brew "grep"
brew "htop"
brew "jq"
brew "k6"
brew "moreutils"
brew "nkf"
brew "node"
brew "num-utils"
brew "openjdk"
brew "php"
brew "plantuml"
brew "pnpm"
brew "pstree"
brew "pwgen"
brew "python@3.12"
brew "rbenv"
brew "rlwrap"
brew "rust"
brew "screen"
brew "swi-prolog"
brew "telnet"
brew "tig"
brew "tree"
brew "util-linux"
brew "vim"
brew "w3m"
brew "watch"
brew "wget"

cask "burp-suite"
cask "docker"
cask "visual-studio-code"
cask "wireshark"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

